In [1]:
import pandas as pd
df=pd.DataFrame({'date':['10/2/2021','11/2/2011','12/2/2011','13/2/2011'],
                'event':['music','poetry','theatre','comedy'],
                'cost':[100000,5000,15000,20000]})
df

        date    event    cost
0  10/2/2021    music  100000
1  11/2/2011   poetry    5000
2  12/2/2011  theatre   15000
3  13/2/2011   comedy   20000

In [2]:
df['Discounted_Price']=df.apply(lambda a:a.cost-(a.cost*0.2),axis=1)
df

        date    event    cost  Discounted_Price
0  10/2/2021    music  100000           80000.0
1  11/2/2011   poetry    5000            4000.0
2  12/2/2011  theatre   15000           12000.0
3  13/2/2011   comedy   20000           16000.0